In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'name':['yejin','jiwon','sanghyeon'],'age':['25','22','32'],
                   'gender':['F','F','M']})

In [4]:
df

        name age gender
0      yejin  25      F
1      jiwon  22      F
2  sanghyeon  32      M

In [7]:
df['age']=df['age'].astype(int)

In [8]:
type(['age'])

list

In [11]:
df.describe()

             age
count   3.000000
mean   26.333333
std     5.131601
min    22.000000
25%    23.500000
50%    25.000000
75%    28.500000
max    32.000000

In [12]:
df['gender']

0    F
1    F
2    M
Name: gender, dtype: object

In [13]:
df[df['name']=='jiwon']

    name  age gender
1  jiwon   22      F

In [17]:
df[(df['age']>22) & (df['gender']=='F')]

    name  age gender
0  yejin   25      F

In [18]:
df = pd.DataFrame({'name':['yejin','jiwon','sanghyeon'],'age':['25','22','32'],
                   'gender':[1,1,0]}, index=['a','b','c'])

In [19]:
df

        name age  gender
a      yejin  25       1
b      jiwon  22       1
c  sanghyeon  32       0

In [20]:
df.loc['a']

name      yejin
age          25
gender        1
Name: a, dtype: object

In [21]:
df.loc['c']

name      sanghyeon
age              32
gender            0
Name: c, dtype: object

In [22]:
df.iloc[0]

name      yejin
age          25
gender        1
Name: a, dtype: object

In [23]:
df.iloc[-1]

name      sanghyeon
age              32
gender            0
Name: c, dtype: object

In [26]:
type(df.iloc[-1])

pandas.core.series.Series

In [24]:
df.iloc[0, -1] #?????

1

In [25]:
df.iloc[0]+df.iloc[-1]

name      yejinsanghyeon
age                 2532
gender                 1
dtype: object

In [27]:
df1 = pd.DataFrame({'A':[1,2,3,4],
                    'B':[5,6,7,8],
                   'C':[9,10,11,12]})
df2 = pd.DataFrame({'A':[13,14,15,16],
                    'B':[17,18,19,20],
                   'C':[21,22,23,24]})

In [28]:
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [29]:
df2

    A   B   C
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [30]:
df3=pd.concat([df1, df2])

In [31]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [34]:
df3 = df3.reset_index(drop=True)

In [41]:
df3.drop(columns = 'index', inplace=True)

In [42]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [43]:
pd.concat([df1, df2], axis =1)

   A  B   C   A   B   C
0  1  5   9  13  17  21
1  2  6  10  14  18  22
2  3  7  11  15  19  23
3  4  8  12  16  20  24

In [44]:
df1['D'] = [13, 14, 15, 16]

In [46]:
type(df1['D'])

pandas.core.series.Series

In [47]:
df1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [48]:
df1.drop('A', axis=1, inplace=True)

In [49]:
df1

   B   C   D
0  5   9  13
1  6  10  14
2  7  11  15
3  8  12  16

In [50]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [51]:
df4 = df1 +df3

In [52]:
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [54]:
df4 = pd.concat([df1, df2], axis=1)

In [55]:
df4

   B   C   D   A   B   C
0  5   9  13  13  17  21
1  6  10  14  14  18  22
2  7  11  15  15  19  23
3  8  12  16  16  20  24

## Groupby

In [1]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT','MSFT','FB','FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Veanessa', 'Carl', 'Sarah'],
       'Sales': [200, 120, 340, 124, 243, 350]}

In [3]:
import pandas as pd

In [4]:
df= pd.DataFrame(data)

In [5]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veanessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [7]:
df['Company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64

In [11]:
type(df['Company'].unique())

numpy.ndarray

In [13]:
for com in df['Company'].unique() :
    print(com, df[df['Company']==com]['Sales']\
    .mean())

GOOG 160.0
MSFT 232.0
FB 296.5

In [14]:
print(df[df['Company'] =='GOOG']['Sales'].mean())
print(df[df['Company'] =='MSFT']['Sales'].mean())
print(df[df['Company'] =='FB']['Sales'].mean())#회사별 sales 값의 평균

160.0
232.0
296.5

In [15]:
df.groupby('Company')

In [16]:
list(df.groupby('Company'))

[('FB',
    Company Person  Sales
  4      FB   Carl    243
  5      FB  Sarah    350),
 ('GOOG',
    Company   Person  Sales
  0    GOOG      Sam    200
  1    GOOG  Charlie    120),
 ('MSFT',
    Company    Person  Sales
  2    MSFT       Amy    340
  3    MSFT  Veanessa    124)]

In [17]:
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [18]:
df.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [19]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [23]:
df.groupby(['Company','Person']).max()

                  Sales
Company Person
FB      Carl        243
        Sarah       350
GOOG    Charlie     120
        Sam         200
MSFT    Amy         340
        Veanessa    124

In [24]:

df = pd.DataFrame({'수학점수':[65,80,60,80], 
                   '과학점수':[50,75,60,80],

                   '내신등급':[3,1,2,1]})

In [25]:
df

   수학점수  과학점수  내신등급
0    65    50     3
1    80    75     1
2    60    60     2
3    80    80     1

In [26]:
df.sort_values(by='수학점수',ascending = False)

   수학점수  과학점수  내신등급
1    80    75     1
3    80    80     1
0    65    50     3
2    60    60     2

In [31]:
df.groupby('내신등급')['과학점수'].mean()

내신등급
1    77.5
2    60.0
3    50.0
Name: 과학점수, dtype: float64

In [29]:
type(df.groupby('내신등급')['과학점수'].min())

pandas.core.series.Series